

#主成份分析(Principal Component Analysis, PLA)


#因為會對原始資料進行轉軸，因此有時候會比較難解釋




#############################################################################
#讀取資料:
data <- read.csv("2012MLB.csv",  # 資料檔名 
                 header=T,          # 資料中的第一列，作為欄位名稱
                 sep=",")           # 將逗號視為分隔符號來讀取資料

head(data)




#############################################################################
#選擇一壘安打、二壘安打、三壘安打、全壘打、打點、盜壘次數、四壞球，
#這七個變數，進行主成份分析prcomp()：

pca <- prcomp(formula = ~ H1B+H2B+H3B+HR+RBI+SB+BB,  #選擇七個變數 
              data = data,                           # 資料
              scale = TRUE)                          # 正規化資料

pca  
# Standard deviations (1, .., p=7):
#     [1] 1.42 1.38 1.01 0.96 0.77 0.71 0.19
# 
# Rotation (n x k) = (7 x 7):
#        PC1   PC2    PC3     PC4     PC5   PC6    PC7
# H1B -0.410 -0.47  0.072  0.0567 -0.0788 -0.67 -0.392
# H2B -0.514 -0.20  0.017  0.2554 -0.4681  0.62 -0.149
# H3B  0.019 -0.56 -0.194 -0.0041  0.7149  0.35 -0.125
# HR  -0.343  0.54 -0.034 -0.3941  0.2640  0.11 -0.592
# RBI -0.646  0.10 -0.254 -0.1568  0.2008 -0.12  0.654
# SB   0.167 -0.27 -0.529 -0.6792 -0.3918  0.04 -0.032
# BB   0.059  0.22 -0.782  0.5387 -0.0068 -0.13 -0.173

# Standard deviations：
#特徵值開根號
# 
# Rotation：
#特徵向量，也就是各個主成份，所對應的線性組合(linear combination)的係數




#############################################################################
#選擇幾個主成份

#繪製「陡坡圖Scree plot」以及「累積解釋圖Pareto plot」：


#############################################################################
#陡坡圖(Scree plot)-凱莎原則
# 使用plot()函式
plot(pca,         # 放pca
     type="line", # 用直線連結每個點
     main="Scree Plot for 2012MLB") # 主標題

# 用藍線標示出特徵值=1的地方
abline(h=1, col="blue") # Kaiser eigenvalue-greater-than-one rule

# 根據凱莎原則，特徵值大於1的主成份就可以選取；
# 而且第三個以後的主成份變異趨於平緩，
# 因此選擇前三個主成份是比較好的選擇。



#############################################################################
#累積解釋圖(Pareto plot)

# 1.求出每個主成份的特徵值(也就是variance = std^2)
vars <- (pca$sdev)^2  # 從pca中取出標準差(pca$sdev)後再平方，計算variance(特徵值)
vars

# 2.計算每個主成分的解釋比例 = 各個主成份的特徵值/總特徵值
props <- vars / sum(vars)  # 計算每個主成分的解釋比例 = 各個主成分的特徵值/總特徵值  
props

# 3.累加每個主成份的解釋比例(aggregated effects)
cumulative.props <- cumsum(props)  # 累加前n個元素的值
cumulative.props

# 4.把累積解釋比例畫成圖：
cumulative.props[3]  #當我們取前三個主成份，可以解釋 71% 的變異
plot(cumulative.props) # 累積解釋比例圖





#############################################################################
#原本的資料集，經過主成份分析後，會轉換成新的以主成份代替的資料集(pca$x)
#取前三個主成份，作為新的資料集：

# pca$rotation 
top3_pca.data <- pca$x[, 1:3]
top3_pca.data 
#       PC1    PC2    PC3
# 1  -2.655  0.046  0.051
# 2  -1.377  0.014  0.245
# 3  -1.578 -1.726  0.148
# 4  -1.768 -0.841 -0.753
# 5  -0.441 -3.665 -0.361
# 6  -1.082 -0.109  0.274
# 7  -0.455 -2.657  1.136
# 8  -2.464  0.031  1.323
# 9  -0.112 -1.299 -0.838
# 10 -1.014  0.553  0.516
# 11 -1.535  3.144 -1.020
# 12 -1.207 -0.283 -1.242
# 13 -1.069  0.225 -0.726
# 14  0.011 -0.251  0.557
# 15 -0.259  1.044  0.464
# 16 -0.324  0.640  0.362
# 17  0.461  0.617  0.677
# 18  0.417  0.711 -1.216
# 19  1.041  0.120 -0.633
# 20  1.397 -0.531  0.670
# 21  1.640 -1.541 -1.669
# 22 -0.519  2.460  1.362
# 23  1.103  0.605  1.704
# 24  1.919 -1.150 -0.647
# 25  0.845  1.553  0.063
# 26  1.746 -0.610  1.365
# 27  1.234  0.912 -2.166
# 28  2.604  0.082  0.874
# 29  1.006  1.507 -1.442
# 30  2.435  0.397  0.922

#############################################################################

# 每一個主成份，都是原變數經過線性組合後產生的值。
# 若有 n 個原變數(columns)，則可以投影出 n 個主成份
# 其中，觀察原變數在線性組合中的係數(Φ；特徵向量)，可以知道主成份和原變數之間的關係
# (例如：正影響/負影響；影響程度多大)。
# 從計算出的 pca 中可以取出 rotation 資訊，其對應的意義為 eigen vector (線性組合中的係數)
#
# 特徵向量(原變數的線性組合)
pca$rotation
#        PC1   PC2    PC3     PC4     PC5   PC6    PC7
# H1B -0.410 -0.47  0.072  0.0567 -0.0788 -0.67 -0.392
# H2B -0.514 -0.20  0.017  0.2554 -0.4681  0.62 -0.149
# H3B  0.019 -0.56 -0.194 -0.0041  0.7149  0.35 -0.125
# HR  -0.343  0.54 -0.034 -0.3941  0.2640  0.11 -0.592
# RBI -0.646  0.10 -0.254 -0.1568  0.2008 -0.12  0.654
# SB   0.167 -0.27 -0.529 -0.6792 -0.3918  0.04 -0.032
# BB   0.059  0.22 -0.782  0.5387 -0.0068 -0.13 -0.173

#取前三個主成份的特徵向量：
top3.pca.eigenvector <- pca$rotation[, 1:3]
top3.pca.eigenvector
#        PC1   PC2    PC3
# H1B -0.410 -0.47  0.072
# H2B -0.514 -0.20  0.017
# H3B  0.019 -0.56 -0.194
# HR  -0.343  0.54 -0.034
# RBI -0.646  0.10 -0.254
# SB   0.167 -0.27 -0.529
# BB   0.059  0.22 -0.782


#############################################################################

#繪製主成份負荷圖，觀察原變數和主成份之間的關係：
first.pca <- top3.pca.eigenvector[, 1]   #  第一主成份
second.pca <- top3.pca.eigenvector[, 2]  #  第二主成份
third.pca <- top3.pca.eigenvector[, 3]   #  第三主成份



# 第一主成份
# SB(盜壘)、BB(四壞球)與PC-1呈現正相關，看起來和「上壘」有關。
# 由小到大排序原變數的係數
first.pca[order(first.pca, decreasing=FALSE)]  
# RBI    H2B    H1B     HR    H3B     BB     SB 
# -0.646 -0.514 -0.410 -0.343  0.019  0.059  0.167 

# 使用dotchart，繪製主成份負荷圖
dotchart(first.pca[order(first.pca, decreasing=FALSE)] ,   # 排序後的係數
         main="Loading Plot for PC1",                      # 主標題
         xlab="Variable Loadings",                         # x軸的標題
         col="red")                                        # 顏色



# 第二主成份
# HR(全壘打)、BB(四壞球)、RBI(打點)與PC-2呈現正相關，看起來和「打擊者」有關。
# 由小到大排序原變數的係數
second.pca[order(second.pca, decreasing=FALSE)]  
# H3B   H1B    SB   H2B   RBI    BB    HR 
# -0.56 -0.47 -0.27 -0.20  0.10  0.22  0.54 

# 使用dotchart，繪製主成份負荷圖
dotchart(second.pca[order(second.pca, decreasing=FALSE)] ,  # 排序後的係數
         main="Loading Plot for PC2",                       # 主標題
         xlab="Variable Loadings",                          # x軸的標題
         col="blue")                                        # 顏色



# 第三主成份
# H1B(一壘安打)、H2B(二壘安打)與PC-3呈現正相關，看起來和「安打」有關。
# 由小到大排序原變數的係數
third.pca[order(third.pca, decreasing=FALSE)]  
# BB     SB    RBI    H3B     HR    H2B    H1B 
# -0.782 -0.529 -0.254 -0.194 -0.034  0.017  0.072

# 使用dotchart，繪製主成份負荷圖
dotchart(third.pca[order(third.pca, decreasing=FALSE)] ,   # 排序後的係數
         main="Loading Plot for PC3",                      # 主標題
         xlab="Variable Loadings",                         # x軸的標題
         col="purple")                                     # 顏色



# 也可以繪製另一種主成份負荷圖，觀察每個球隊擅長的特性是什麼：
# 
# 選取 PC1 和 PC2 繪製主成份負荷圖
biplot(pca, choices=1:2)  

# 右邊的球隊適合上壘，多以盜壘(SB)和四壞球(BB)保送見長，全壘打表現中等(e.g.編號19)
# 
# 左上方的球隊以力量取勝，在全壘打(HR)和打點(RBI)上有顯著的優勢(e.g.編號11)
# 
# 下方的球隊不擅長全壘打，但在安打上的表現遠勝於其他球隊，盜壘也有一定水準(e.g.編號5)








